arduino/ArduinoCore-samd/boards.txt
# MattairTech Core for Arduino Zero (8KB bootloader, Native USB Port)
arduino_zero_native.name=Arduino Zero (Native USB Port)
arduino_zero_native.vid.0=0x2341
arduino_zero_native.pid.0=0x804d
arduino_zero_native.vid.1=0x2341
arduino_zero_native.pid.1=0x004d
arduino_zero_native.upload.tool=MattairTech_Arduino:bossac
arduino_zero_native.upload.protocol=sam-ba
arduino_zero_native.upload.maximum_size=262144
arduino_zero_native.upload.use_1200bps_touch=true
arduino_zero_native.upload.wait_for_upload_port=true
arduino_zero_native.upload.native_usb=true
arduino_zero_native.build.mcu=cortex-m0plus
arduino_zero_native.build.f_cpu=48000000L
arduino_zero_native.build.usb_product="Arduino Zero"
arduino_zero_native.build.usb_manufacturer="Arduino LLC"
arduino_zero_native.build.board=SAMD_ZERO
arduino_zero_native.menu.com.cdc_hid_uart=CDC_HID_UART
arduino_zero_native.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
arduino_zero_native.menu.com.cdc_uart=CDC_UART
arduino_zero_native.menu.com.cdc_uart.build.board=CDC_UART
arduino_zero_native.menu.com.cdc_hid=CDC_HID
arduino_zero_native.menu.com.cdc_hid.build.board=CDC_HID
arduino_zero_native.menu.com.cdc=CDC_ONLY
arduino_zero_native.menu.com.cdc.build.board=CDC_ONLY
arduino_zero_native.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
arduino_zero_native.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
# arduino_zero_native.menu.com.cdc_msd_hid_uart=CDC_MSD_HID_UART
# arduino_zero_native.menu.com.cdc_msd_hid_uart.build.board=CDC_MSD_HID_UART
# arduino_zero_native.menu.com.cdc_msd_midi_hid_uart=CDC_MSD_MIDI_HID_UART
# arduino_zero_native.menu.com.cdc_msd_midi_hid_uart.build.board=CDC_MSD_MIDI_HID_UART
# arduino_zero_native.menu.com.msd_uart=MSD_UART
# arduino_zero_native.menu.com.msd_uart.build.board=MSD_UART
arduino_zero_native.menu.com.uart=UART_ONLY
arduino_zero_native.menu.com.uart.build.board=UART_ONLY
arduino_zero_native.menu.com.none=USB_UART_DISABLED
arduino_zero_native.menu.com.none.build.board=USB_UART_DISABLED
arduino_zero_native.build.core=arduino
arduino_zero_native.build.extra_flags=-D__SAMD21G18A__ -D__8KB_BOOTLOADER__ {build.usb_flags}
arduino_zero_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_native.build.variant=arduino_zero
arduino_zero_native.build.variant_system_lib=
arduino_zero_native.build.vid=0x2341
arduino_zero_native.build.pid=0x804d

# MattairTech Core for Arduino Zero (8KB bootloader, Programming Port)
#arduino_zero_edbg.name=Arduino Zero (Programming Port)
#arduino_zero_edbg.vid.0=0x03eb
#arduino_zero_edbg.pid.0=0x2157
#arduino_zero_edbg.upload.tool=arduino:openocd
#arduino_zero_edbg.upload.protocol=sam-ba
#arduino_zero_edbg.upload.maximum_size=262144
#arduino_zero_edbg.upload.use_1200bps_touch=false
#arduino_zero_edbg.upload.wait_for_upload_port=false
#arduino_zero_edbg.upload.native_usb=false
#arduino_zero_edbg.build.mcu=cortex-m0plus
#arduino_zero_edbg.build.f_cpu=48000000L
#arduino_zero_edbg.build.usb_product="Arduino Zero"
#arduino_zero_edbg.build.usb_manufacturer="Arduino LLC"
#arduino_zero_edbg.build.board=SAMD_ZERO
#arduino_zero_edbg.menu.com.cdc_hid_uart=CDC_HID_UART
#arduino_zero_edbg.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
#arduino_zero_edbg.menu.com.cdc_uart=CDC_UART
#arduino_zero_edbg.menu.com.cdc_uart.build.board=CDC_UART
#arduino_zero_edbg.menu.com.cdc_hid=CDC_HID
#arduino_zero_edbg.menu.com.cdc_hid.build.board=CDC_HID
#arduino_zero_edbg.menu.com.cdc=CDC_ONLY
#arduino_zero_edbg.menu.com.cdc.build.board=CDC_ONLY
#arduino_zero_edbg.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
#arduino_zero_edbg.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
# arduino_zero_edbg.menu.com.cdc_msd_hid_uart=CDC_MSD_HID_UART
# arduino_zero_edbg.menu.com.cdc_msd_hid_uart.build.board=CDC_MSD_HID_UART
# arduino_zero_edbg.menu.com.cdc_msd_midi_hid_uart=CDC_MSD_MIDI_HID_UART
# arduino_zero_edbg.menu.com.cdc_msd_midi_hid_uart.build.board=CDC_MSD_MIDI_HID_UART
# arduino_zero_edbg.menu.com.msd_uart=MSD_UART
# arduino_zero_edbg.menu.com.msd_uart.build.board=MSD_UART
#arduino_zero_edbg.menu.com.uart=UART_ONLY
#arduino_zero_edbg.menu.com.uart.build.board=UART_ONLY
#arduino_zero_edbg.menu.com.none=USB_UART_DISABLED
#arduino_zero_edbg.menu.com.none.build.board=USB_UART_DISABLED
#arduino_zero_edbg.build.core=arduino
#arduino_zero_edbg.build.extra_flags=-D__SAMD21G18A__ -D__8KB_BOOTLOADER__ {build.usb_flags}
#arduino_zero_edbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
#arduino_zero_edbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
#arduino_zero_edbg.build.variant=arduino_zero
#arduino_zero_edbg.build.variant_system_lib=
#arduino_zero_edbg.build.vid=0x2341
#arduino_zero_edbg.build.pid=0x804d
#arduino_zero_edbg.bootloader.tool=arduino:openocd
#arduino_zero_edbg.bootloader.file=zero/samd21g18a_sam_ba.bin
